import numpy as np

# 배열 중 (i, j)가 있을 때, 상태 i에서 상태 j로 가는 행동을 뜻한다.

# 방향 그래프를 이용한 상태 변환 확률. s9는 종료 상태
directedGraph = np.array([
    [0, 0.5, 0.5, 0, 0, 0, 0, 0, 0, 0],
    [0.4, 0, 0.3, 0, 0, 0, 0, 0, 0.3, 0],
    [0, 0, 0, 0.8, 0, 0.2, 0, 0, 0, 0],
    [0.6, 0, 0, 0, 0.4, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0.5, 0.5, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0.4, 0.3, 0.3, 0],
    [0, 0, 0, 0, 0.2, 0, 0, 0.4, 0, 0.4],
    [0, 0, 0, 0, 0, 0, 0.2, 0, 0, 0.8],
    [0, 0, 0, 0, 0, 0, 0, 0.6, 0.4, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
])

# 각 행동에 따른 보상
rewardList = np.array([
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 1, 0, 0, 0, 0, 0, -1, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [-1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 1, -1, -2, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 10],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 2],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
])

# 감가율
discountingRate = 0.9

# 기대 보상 벡터 B 계산, aixs = 1로 같은 행끼리 계산하게, keepdims =  True로 열 벡터를 유지하게 함
B = np.sum(directedGraph * rewardList, axis = 1, keepdims = True)[:9]

# 감가율이 적용된 상태 변환 확률 행렬 A
A = directedGraph[:9, :9] * discountingRate


#  x = A * x + B                x는 각 상태의 가치함수가 담긴 벡터
#  (I - A) * x = B
#  x = (I - A)^(-1) * B


# (I - A)
tmp = np.subtract(np.eye(9), A)

# (I - A)^(-1)
tmp_inv = np.linalg.inv(tmp)

# (I - A)^(-1) * B
x = tmp_inv @ B

print('\ndet A\n', A)
print('\ndet B\n', B)
print('\nx = v(n)')

n = 0
for i in x :
    print('v(' + str(n) + ') = ' + str(i))
    n += 1